[
  { "bhavan": "Bill Gates Bhavan", "way": "To reach Bill Gates Bhavan, begin at the main gate and walk straight ahead until you arrive at the Emblem. From there, take a left turn and continue walking for about 70 to 100 meters. At this point, you'll come across a right turn—take that turn and proceed straight for approximately 20 to 50 meters. As you move along this path, Bill Gates Bhavan will appear on your left side." },
  { "bhavan": "Vishveshwaraya bhavan", "way": "Here is the location of Vishveshwaraya Bhavan described in a paragraph:To reach Vishveshwaraya Bhavan, start from the main gate and go straight until you reach the Emblem. From the Emblem, take a left and walk for about 70 to 100 meters, then take a right turn. Continue walking 20 to 50 meters straight, passing Bill Gates Bhavan on your left. From there, follow the path straight ahead, and you’ll come across a small curve in the road. Keep going straight through the curve, and shortly after, you will arrive at **Vishveshwaraya Bhavan, which lies directly along this continued path." },
  { "bhavan": "CV Raman Bhavan", "way": "Here is the location of CV Raman Bhavan described in a paragraph:To reach CV Raman Bhavan, begin at the main gate and walk straight until you reach the Emblem. From there, take a left and continue for about 70 to 100 meters, then take a right turn. Go straight for 20 to 50 meters, where you'll find Bill Gates Bhavan on your left. Continue walking straight past Bill Gates Bhavan, following the small curve in the road. After passing Vishveshwaraya Bhavan, keep going in the same direction, and you’ll arrive at **CV Raman Bhavan. It is located further along the same route, just beyond Vishveshwaraya Bhavan." },
  { "bhavan": "Cotton Bhavan", "way": "To reach Cotton Bhavan, start at the main gate and walk straight until you arrive at the Emblem. From the Emblem, take a left turn and continue straight for about 70 to 100 meters until you reach the Horse Statue. Standing at the Horse Statue, look straight ahead—you will see Cotton Bhavan directly in front of you. It is positioned facing the Horse Statue, with Ratan Tata Bhavan located nearby and KL Rao Bhavan on the opposite side." },
  { "bhavan": "Ratan Tata Bhavan", "way": "To reach Ratan Tata Bhavan, start at the main gate and walk straight until you arrive at the Emblem. From the Emblem, take a left turn and continue walking for about 70 to 100 meters. You will then see the prominent Horse Statue ahead. As you approach the Horse Statue, take the path toward the statue this is your cue that you're close. Ratan Tata Bhavan is located in the direction of and near the Horse Statue, just as if you're walking directly toward it. It sits nearby, making it one of the buildings easily visible and accessible once you reach this landmark." },
  { "bhavan": "KL Rao Bhavan", "way":"To reach KL Rao Bhavan, begin at the main gate and walk straight until you reach the Emblem. From the Emblem, take a left and continue walking for 70 to 100 meters until you reach the Horse Statue. KL Rao Bhavan is located on the opposite side of the Horse Statue" },
  {"bhavan" : "Ramanujan Bhavan", "way": "To reach Ramanujan Bhavan, start from the main gate and walk straight to reach the Emblem. From the Emblem, take a left turn and go 70 to 100 meters, then take a right turn and walk 20 to 50 meters straight, passing Bill Gates Bhavan on your left. Continue moving forward along the curved path—you will pass Vishveshwaraya Bhavan first, and then CV Raman Bhavan. Just after CV Raman Bhavan, you’ll see a Ground on the right side. Ramanujan Bhavan is located to the right of that Ground"}
]