[
  { "bhavan": "Bill Gates Bhavan", "way": "From the main gate, walk straight to the campus emblem.Take a left, walk 50–100 m, then take a right and continue another 50–100 m.Bill Gates Bhavan will be on your left-hand side" },
  { "bhavan": "Vishveshwaraya bhavan", "way": "Start by going straight until you reach the emblem.Take a left and continue for about 50–100 meters.Then, take a right and go straight for another 50–100 meters.On the left side, you will see Bill Gates Bhavan.To reach Vishveshwaraya Bhavan from Bill Gates Bhavan:Continue in the same direction towards the right, where there's a small curve.After the curve, take a left and move straight for about 20 meters.Vishveshwaraya Bhavan will be on the side." },
  { "bhavan": "CV Raman Bhavan", "way": "To reach CV Raman Bhavan from the main gate of Aditya Engineering College, start by walking straight along the main campus road. After about 100–150 meters, you will arrive at the central emblem landmark. From there, take a left turn and continue walking for around 50–100 meters. Then, take a right and walk straight for another 50–100 meters. You will first see Bill Gates Bhavan on your left side. CV Raman Bhavan is located directly to the right of Bill Gates Bhavan, making it easy to spot once you’re in that area." },
  { "bhavan": "Cotton Bhavan", "way": "To reach Cotton Bhavan from the main gate of Aditya Engineering College, start by walking straight along the main road inside the campus. After about 100–150 meters, you will come across a prominent emblem landmark in the center. From there, take a left turn and continue walking straight for another 50 to 100 meters. As you proceed, you will notice a horse statue on your path. Cotton Bhavan is located directly in front of the horse statue, making it easily identifiable from that point." },
  { "bhavan": "Ratan Tata Bhavan", "way": "Go straight until you reach the emblem. From there, take a left and walk about 50–100 meters until you reach the statue. Then continue straight ahead to reach Ratan Tata Bhavan." },
  { "bhavan": "KL Rao Bhavan", "way": "From the emblem, take a left.Walk about 50–100 meters.Take a right turn and walk straight for another 50–100 meters.On your left side, you will see Bill Gates Bhavan.From Bill Gates Bhavan, continue in the same direction.Follow a small curve to the right.After the curve, take a left.Walk about 20 meters straight.Visveswaraya Bhavan will be on your side, to the right of Bill Gates Bhavan." },
  {"bhavan" : "Ramanujan Bhavan", "way": "To reach Vishveshwaraya Bhavan from the main gate of Aditya Engineering College, start by entering through the main gate and continue going straight along the main road. After a short distance, you will arrive at a central emblem or statue, which serves as a landmark. At this point, take a left turn and proceed for about 50 to 100 meters. Then, take a right turn and continue straight for another 50 to 100 meters. On your left side, you will first notice Bill Gates Bhavan. From there, continue following the same path as it curves slightly to the right. After the curve, take a left turn and walk straight for about 20 meters. On the left side, you will find Vishveshwaraya Bhavan."}
]  
